In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
%matplotlib inline

In [11]:
# check submission format for Round 1 
sample_pred = pd.read_csv('data/MSampleSubmissionStage1_2020.csv')
display(sample_pred.head())
print(len(sample_pred))

               ID  Pred
0  2015_1107_1112   0.5
1  2015_1107_1116   0.5
2  2015_1107_1124   0.5
3  2015_1107_1125   0.5
4  2015_1107_1129   0.5

11390

### Generate Labels

In [39]:
compact_results = pd.read_csv('data/MDataFiles_Stage1/MNCAATourneyCompactResults.csv')
display(compact_results.head())
print(len(compact_results))

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985     136     1116      63     1234      54    N      0
1    1985     136     1120      59     1345      58    N      0
2    1985     136     1207      68     1250      43    N      0
3    1985     136     1229      58     1425      55    N      0
4    1985     136     1242      49     1325      38    N      0

2251

In [44]:
# generate game ID and label 
compact_results = compact_results.assign(
    ID = lambda x: x['Season'].astype(str) + '_' + x[['WTeamID','LTeamID']].min(axis=1).astype(str) \
        + '_' + x[['WTeamID','LTeamID']].max(axis=1).astype(str),
    Outcome = lambda x: np.where(x['WTeamID'] < x['LTeamID'], 1, 0)
)
compact_results.head()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,WLoc,NumOT,ID,Outcome
0,1985,136,1116,63,1234,54,N,0,1985_1116_1234,1
1,1985,136,1120,59,1345,58,N,0,1985_1120_1345,1
2,1985,136,1207,68,1250,43,N,0,1985_1207_1250,1
3,1985,136,1229,58,1425,55,N,0,1985_1229_1425,1
4,1985,136,1242,49,1325,38,N,0,1985_1242_1325,1

### Parse Seeds

In [51]:
seeds = pd.read_csv('data/MDataFiles_Stage1/MNCAATourneySeeds.csv')
display(seeds.head())
len(seeds)

   Season Seed  TeamID
0    1985  W01    1207
1    1985  W02    1210
2    1985  W03    1228
3    1985  W04    1260
4    1985  W05    1374

2286

In [54]:
seeds['SeedNum'] = seeds['Seed'].apply(lambda x: int(x[1:3]))
seeds['SeedNum'].value_counts().sort_index()

1     140
2     140
3     140
4     140
5     140
6     140
7     140
8     140
9     140
10    140
11    153
12    143
13    141
14    141
15    140
16    168
Name: SeedNum, dtype: int64